app/controllers/defects_controller.rb

  def index
    @defects = Defect.all
---
SELECT `defects`.* FROM `defects`

  def create
    @defect = Defect.new(defect_params)

    if @defect.save
---
INSERT INTO `defects` (`location`, `description`, `created_at`, `updated_at`) VALUES ('something to do', 'Description 1', '2017-08-11 06:14:11', '2017-08-11 06:14:11')